{
  "id": "lake-legends-halloween",
  "title": {
    "defaultText": "The Halloween Summoning Begins!",
    "localizations": [
      { "languageCode": "es", "text": "¡Comienza la Invocación de Halloween!" },
      { "languageCode": "pt", "text": "A Invocação de Halloween Começa!" },
      { "languageCode": "sv", "text": "Halloween-Besväringen Börjar!" }
    ]
  },
  "description": {
    "defaultText": "<size=24px>This Halloween, something ancient stirs beneath the lakes…\n\nCollect fish scales from all across the world of Lake Legends.\nBring them to <b>Elder Mistress Thalira</b> at the Cauldron.\nShe'll cast a powerful ritual to summon the <b>Ancient Ones</b> — champions of gods… or demons.\n\nThese are the hardest fish to catch yet. You might not land them on your first try.\nBut those who do? Earn glory, power — and a place in Lake Legends history.\n\nStart with the <b>Halloween Ancients</b>, available for a limited time!\nMore ancients tied to other lakes will awaken soon…",
    "localizations": [
      {
        "languageCode": "es",
        "text": "<size=24px>Este Halloween, algo ancestral se agita bajo los lagos…\n\nRecolecta escamas de peces de todo el mundo de Lake Legends.\nLlévalas a la <b>Anciana Maestra Thalira</b> en el Caldero.\nElla realizará un poderoso ritual para invocar a los <b>Ancestrales</b> — campeones de dioses… o demonios.\n\nEstos son los peces más difíciles de atrapar hasta ahora. Puede que no los captures en tu primer intento.\nPero, ¿aquellos que lo logran? Ganan gloria, poder — y un lugar en la historia de Lake Legends.\n\n¡Comienza con los <b>Ancestrales de Halloween</b>, disponibles por tiempo limitado!\nMás ancestrales vinculados a otros lagos despertarán pronto…"
      },
      {
        "languageCode": "pt",
        "text": "<size=24px>Neste Halloween, algo ancestral se agita sob os lagos…\n\nColete escamas de peixes de todo o mundo de Lake Legends.\nLeve-as para a <b>Anciã Mestra Thalira</b> no Caldeirão.\nEla lançará um ritual poderoso para invocar os <b>Ancestrais</b> — campeões dos deuses… ou demônios.\n\nEstes são os peixes mais difíceis de capturar até agora. Você pode não pegá-los na primeira tentativa.\nMas aqueles que conseguem? Ganham glória, poder — e um lugar na história de Lake Legends.\n\nComece com os <b>Ancestrais de Halloween</b>, disponíveis por tempo limitado!\nMais ancestrais ligados a outros lagos despertarão em breve…"
      },
      {
        "languageCode": "sv",
        "text": "<size=24px>Denna Halloween rör sig något uråldigt under sjöarna…\n\nSamla fiskfjäll från hela Lake Legends-världen.\nFör dem till <b>Äldste Härskarinnan Thalira</b> vid Kitteln.\nHon kommer att utföra en kraftfull ritual för att frammana de <b>Uråldriga</b> — gudarnas... eller demonernas förkämpar.\n\nDessa är de svåraste fiskarna att fånga hittills. Du kanske inte landar dem på första försöket.\nMen de som lyckas? Vinner ära, kraft — och en plats i Lake Legends historia.\n\nBörja med <b>Halloween-Uråldriga</b>, tillgängliga under begränsad tid!\nFler uråldriga kopplade till andra sjöar kommer att vakna snart…"
      }
    ]
  },
  "imageUrl": "https://bridgegamesstudio.github.io/lake-legends-news/news/images/lake-legends-halloween.png",
  "videoUrl": "https://youtube.com/shorts/44q8ZGQpQxg?feature=share",
  "date": "2025-10-27",
  "isShortVideo": true,
  "socials": {
    "twitter": "https://x.com/BridgeGamesDev",
    "bsky": "https://bsky.app/profile/bridgegamesstudio.bsky.social",
    "instagram": "https://www.instagram.com/bridgegamesstudio_official/",
    "discord": "https://discord.gg/yXDmATPzA4",
    "website": "https://bridgegamesstudio.com",
    "tiktok": "https://www.tiktok.com/@bridgegamesstudio",
    "youtube": "https://www.youtube.com/@BridgeGamesStudio"
  }
}
